// Создать функцию которая принимает буфер на основе ваших имен
//зашифровать эту информацию. Расшифровать полученный шифр и получить имя.

// Создать child_process В котором отправить ребенку зашифрованную имя и то же имя в нерасшифрованнам виде,
// создать hmac
// на основе нерасшифр данных, внутри доч процесса. Создать еще один процесс внутри дочернего процесса
// Отправить зашифрованные данные этому процессу. Этот процесс должен расшифровать этот шифр.
// Получить в самом главном процессе и расшированные данные и hmac